# Використовуємо офіційний імедж nginx з Docker Hub як базовий
FROM nginx:latest

# Встановлюємо метадані, такі як мейнтейнер або версію
LABEL maintainer="aspirant89@gmail.com"

# Копіюємо файл index.html з локального директорію до директорії /usr/share/nginx/html всередині контейнера
COPY index.html /usr/share/nginx/html/index.html

# Вказуємо Docker, що контейнер слухає на порту 80
EXPOSE 80

# Використовуємо команду CMD для запуску nginx. Nginx вже налаштований
# на автоматичний запуск і слухання на порту 80 в базовому імеджі, але ви можете
# додати специфічні команди запуску або конфігураційні файли, якщо це необхідно.
# CMD ["nginx", "-g", "daemon off;"]

# Оскільки nginx запускається автоматично і слухає порт 80, команду CMD можна опустити,
# хіба що вам потрібно перевизначити параметри запуску за замовчуванням.
